app/views/food_entries/index.html.erb

            <td style="padding: 12px; border: 1px solid #ddd; background-color: #ffffff; color: #000;">
              <% if item[:type] == 'symptom' && item[:entry].severity.present? %>
---
SELECT 1 AS one FROM "food_entries" LIMIT 1