app/controllers/food_entries_controller.rb

  def index
    @food_entries = FoodEntry.recent
    @gi_symptoms = GiSymptom.recent
    @bowel_movements = BowelMovement.recent
    # Combine and sort by datetime for unified timeline view
    @all_entries = (@food_entries.map { |e| { type: 'food', entry: e, datetime: e.consumed_at } } +
                    @gi_symptoms.map { |s| { type: 'symptom', entry: s, datetime: s.occurred_at } } +
                    @bowel_movements.map { |b| { type: 'bowel_movement', entry: b, datetime: b.occurred_at } })
                  .sort_by { |e| e[:datetime] }
                  .reverse
---
SELECT "bowel_movements".* FROM "bowel_movements" ORDER BY "bowel_movements"."occurred_at" DESC
SELECT "food_entries".* FROM "food_entries" ORDER BY "food_entries"."consumed_at" DESC
SELECT "gi_symptoms".* FROM "gi_symptoms" ORDER BY "gi_symptoms"."occurred_at" DESC

  def create
    @food_entry = FoodEntry.new(food_entry_params)

    if @food_entry.save
---
INSERT INTO "food_entries" ("description", "consumed_at", "notes", "created_at", "updated_at") VALUES ('strawberries and some other stuff', '2025-11-29 18:33:00', '', '2025-11-30 01:34:51.145396', '2025-11-30 01:34:51.145396') RETURNING "id"