app/controllers/gi_symptoms_controller.rb

  def create
    @gi_symptom = GiSymptom.new(gi_symptom_params)

    if @gi_symptom.save
---
INSERT INTO "gi_symptoms" ("symptom_type", "occurred_at", "severity", "notes", "created_at", "updated_at") VALUES ('Constipation', '2025-11-29 19:37:00', 2, '', '2025-11-30 01:38:51.689402', '2025-11-30 01:38:51.689402') RETURNING "id"